var SEARCH_SERVER = "http://127.0.0.1:8080/e.morntea.com/"; //http://e.morntea.com/

function getHint(question) {
	var hint = null;
	var pl = question.lastIndexOf("（");
	var pr = question.lastIndexOf("）");	//parenthesis
	if(pl!=-1 && pr==question.length-1) {
		hint = question.substring(pl+1, question.lastIndexOf("）"));
	}
	return hint;
}

function getGivenAnswer(question) {
	var answer = null;
	var hint = getHint(question);
	if(hint!=null) {
		if(hint.indexOf("个")==-1 && hint.indexOf("字")==-1 && hint.indexOf("格式")==-1 && hint.indexOf("如")==-1){
			answer = hint.replace("答案是","").replace("答案","").replace("：","").replace(":","");
		}
	}
	return answer;
}

function searchAnswer(question, callback) {
	GM_xmlhttpRequest({
		method: "GET",
		url: SEARCH_SERVER + "search.jsp?onlyanswer&q="+question,
		onload: function(response) {
			callback(response.responseText);
		}
	});
}

function getLostWord(question, callback) {
	var lp = question.indexOf("：");
	var word = question.substring(lp+1).trim();
	GM_xmlhttpRequest({
		method: "GET",
		url: "http://www.baidu.com/s?wd="+word,//baidu version
		onload: function(response) {
			var pattern = new RegExp("<th><a href=[^>]+>" + word.replace("_", "(.)") +"<\/a>");
			console.log(word);
			console.log(pattern);
			var html = response.responseText;
			//console.log(html);
			var matches = null, found = false;
			if ((matches = pattern.exec(html)) != null) {
				callback(matches[1]);
				found = true;
			}
			if(!found) {
				pattern = new RegExp("<th><a href=[^>]+>.*?" + word.replace("_", "(.)") +".*?<\/a>");
				console.log(pattern);
				if ((matches = pattern.exec(html)) != null) {
					callback(matches[1]);
					found = true;
				}
			}
		}
	});
}

function getCity(question) {
	var provCity = [["北京", "京", "北京"], ["上海", "沪", "上海"], ["天津", "津", "天津"], ["重庆", "渝", "重庆"], ["黑龙江", "黑", "哈尔滨"], ["吉林", "吉", "长春"], ["辽宁", "辽", "沈阳"], ["内蒙古", "蒙", "呼和浩特"], ["河北", "冀", "石家庄"], ["新疆", "新", "乌鲁木齐"], ["甘肃", "甘", "兰州"], ["青海", "青", "西宁"], ["陕西", "陕", "西安"], ["宁夏", "宁", "银川"], ["河南", "豫", "郑州"], ["山东", "鲁", "济南"], ["山西", "晋", "太原"], ["安徽", "皖", "合肥"], ["湖北", "鄂", "武汉"], ["湖南", "湘", "长沙"], ["江苏", "苏", "南京"], ["四川", "川", "成都"], ["贵州", "黔", "贵阳"], ["云南", "滇", "昆明"], ["广西", "桂", "南宁"], ["西藏", "藏", "拉萨"], ["浙江", "浙", "杭州"], ["江西", "赣", "南昌"], ["广东", "粤", "广州"], ["福建", "闽", "福州"], ["台湾", "台", "台北"], ["海南", "琼", "海口"], ["香港", "港", "香港"], ["澳门", "澳", "澳门"] 
	];
	var answer = null;
	if(question.indexOf("省会") !=-1 ) {
		for(var i=0; i<provCity.length; i++) {
			if(question.indexOf(provCity[i][0]) != -1) {
				answer = provCity[i][2];
				break;
			}
			if(question.indexOf(provCity[i][2]) != -1) {
				answer = provCity[i][0];
				break;
			}
		}
	} else if(question.indexOf("简称") !=-1 || question.indexOf("缩写") !=-1) {
		for(var i=0; i<provCity.length; i++) {
			if(question.indexOf(provCity[i][0]) != -1) {
				answer = provCity[i][1];
				break;
			}
			if(question.indexOf(provCity[i][1]) != -1) {
				answer = provCity[i][0];
				break;
			}
		}
	}
	return answer;
}

function getCapi(question) {
	var contCapi = [["中国", "北京"], ["韩国", "汉城"], ["朝鲜", "平壤"], ["日本", "东京"], ["马来西亚", "吉隆坡"], ["印度", "新德里"], ["巴基斯坦", "伊斯兰堡"], ["泰国", "曼谷"], ["越南", "河内"], ["斯里兰卡", "科伦坡"], ["缅甸", "仰光"], ["孟加拉国", "达卡"], ["不丹", "廷布"], ["阿富汗", "喀布尔"], ["柬埔寨", "金边"], ["尼泊尔", "加德满都"], ["老挝", "万象"], ["锡金", "甘托克"], ["菲律宾", "马尼拉"], ["阿塞拜疆", "巴库"], ["格鲁吉亚", "第比利斯"], ["亚美尼亚", "埃里温"], ["塔吉克斯坦", "杜尚别"], ["土库曼斯坦", "阿什哈巴德"], ["新加坡", "新加坡"], ["马尔代夫", "马累"], ["文莱", "斯时巴加湾"], ["东帝汶", "帝力"], ["印度尼西亚", "雅加达"], ["伊拉克", "巴格达"], ["伊朗", "德黑兰"], ["约旦", "安曼"], ["沙特阿拉伯", "利雅德"], ["阿联酋", "阿布扎比"], ["阿曼", "马斯喀特"], ["科威特", "科威特"], ["以色列", "特拉维夫"], ["也门", "亚丁"], ["巴勒斯坦", "耶路撒冷"], ["卡塔尔", "多哈"], ["巴林", "麦纳麦"], ["叙利亚", "大马士革"], ["黎巴嫩", "贝鲁特"], ["蒙古", "乌兰巴托"], ["塞浦路斯", "尼科西亚"], ["哈萨克斯坦", "阿斯塔纳"], ["乌兹别克斯坦", "塔什干"], ["吉尔吉斯", "比什凯克"], ["英国", "伦敦"], ["罗马尼亚", "布加勒斯特"], ["法国", "巴黎"], ["波兰", "华沙"], ["瑞士", "伯尔尼"], ["瑞典", "斯德哥尔摩"], ["意大利", "罗马"], ["德国", "柏林"], ["摩纳哥", "摩纳哥"], ["拉脱维亚", "里加"], ["希腊", "雅典"], ["阿尔巴尼亚", "地拉那"], ["挪威", "奥斯陆"], ["南斯拉夫", "贝尔格莱德"], ["保加利亚", "索非亚"], ["荷兰", "阿姆斯特丹"], ["爱尔兰", "都柏林"], ["捷克", "布拉格"], ["斯洛伐克", "布拉迪斯拉发"], ["葡萄牙", "里斯本"], ["斯洛文尼亚", "卢布尔雅那"], ["土耳其", "安卡拉"], ["丹麦", "哥本哈根"], ["卢森堡", "卢森堡"], ["西班牙", "马德里"], ["圣马力诺", "圣马力诺"], ["匈牙利", "布达佩斯"], ["列支敦士登", "瓦杜兹"], ["冰岛", "雷克雅未克"], ["安道尔", "安道尔"], ["芬兰", "赫尔辛基"], ["俄罗斯", "莫斯科"], ["乌克兰", "基辅"], ["白俄罗斯", "明斯克"], ["法罗群岛", "曹斯哈恩"], ["摩尔多瓦", "基希讷乌"], ["立陶宛", "维尔纽斯"], ["爱沙尼亚", "塔林"], ["马其顿", "斯科普里"], ["克罗地亚", "萨格勒布"], ["梵蒂冈", "梵蒂冈城"], ["比利时", "布鲁塞尔"], ["马耳他", "瓦莱塔"], ["安哥拉", "罗安达"], ["埃塞俄比亚", "亚的斯亚贝巴"], ["埃及", "开罗"], ["中非", "班吉"], ["几内亚", "科纳克里"], ["几内亚比绍", "比绍"], ["博茨瓦纳", "哈博罗内"], ["布基纳法索", "瓦加杜古"], ["上沃尔特", "瓦加杜古"], ["马达加斯加", "塔那那利佛"], ["马里", "巴马科"], ["马拉维", "利隆圭"], ["扎伊尔", "金沙萨"], ["赤道几内亚", "马拉博"], ["冈比亚", "班珠尔"], ["贝宁", "波多诺伏"], ["毛里求斯", "路易港"], ["毛里塔尼亚", "努瓦克肖特"], ["乌干达", "坎帕拉"], ["布隆迪", "布琼布拉"], ["卡奔达", "卡奔达"], ["卢旺达", "基加利"], ["乍得", "恩贾梅纳"], ["尼日尔", "尼亚美"], ["尼日利亚", "拉各斯"], ["加纳", "阿克拉"], ["加蓬", "利伯维尔"], ["圣多美和普林西比", "圣多美"], ["吉布提", "吉布提"], ["多哥", "洛美"], ["苏丹", "喀土穆"], ["利比亚", "的黎波里"], ["利比里亚", "蒙罗维亚"], ["佛得角", "普腊亚"], ["阿尔及利亚", "阿尔及尔"], ["纳米比亚", "温得和克"], ["坦桑尼亚", "达累斯萨拉姆"], ["肯尼亚", "内罗毕"], ["南非", "比勒陀利亚"], ["科摩罗", "莫罗尼"], ["津巴布韦", "索尔兹伯里"], ["突尼斯", "突尼斯"], ["莱索托", "马塞卢"], ["莫桑比克", "马普托"], ["索马里", "摩加迪沙"], ["象牙海岸", "阿比让"], ["喀麦隆", "雅温得"], ["塞内加尔", "达喀尔"], ["塞舌尔", "维多利亚"], ["塞拉利昂", "弗里敦"], ["摩洛哥", "拉巴特"], ["赞比亚", "卢萨卡"], ["圣赫勒拿", "詹姆斯敦"], ["留尼汪", "圣但尼"], ["斯威士兰", "姆巴巴纳"], ["西撒哈拉", "阿尤恩"], ["刚果", "布拉柴维尔"], ["美国", "华盛顿"], ["加拿大", "渥太华"], ["秘鲁", "利马"], ["海地", "太子港"], ["萨尔瓦多", "圣萨尔瓦多"], ["智利", "圣地亚哥"], ["古巴", "哈瓦那"], ["尼加拉瓜", "马那瓜"], ["巴哈马", "拿骚"], ["巴拿马", "巴拿马城"], ["玻利维亚", "拉巴斯"], ["洪都拉斯", "特古西加尔巴"], ["厄瓜多尔", "基多"], ["牙买加", "金斯敦"], ["乌拉圭", "蒙得维的亚"], ["巴巴多斯", "布里奇顿"], ["圣卢西亚", "卡斯特里"], ["圭亚那", "乔治敦"], ["危地马拉", "危地马拉"], ["多米尼加", "圣多明各"], ["墨西哥", "墨西哥城"], ["哥伦比亚", "波哥大"], ["安提瓜", "圣约翰"], ["苏里南", "帕拉马里博"], ["伯利兹", "贝尔莫潘"], ["阿根廷", "布宜诺斯艾利斯"], ["维尔京群岛", "罗德城"], ["委内瑞拉", "加拉加斯"], ["哥斯达黎加", "圣约瑟"], ["特立尼达和多巴哥", "西班牙港"], ["格林纳达", "圣乔治"], ["澳大利亚", "堪培拉"], ["新西兰", "惠灵顿"], ["斐济", "苏瓦"], ["马里亚纳群岛", "塞班"], ["汤加", "努库阿洛法"], ["巴布亚新几内亚", "莫尔兹比港"], ["西萨摩亚", "阿皮亚"], ["关岛", "阿加尼亚"], ["图瓦卢", "富纳富提"], ["所罗门群岛", "霍尼亚拉"], ["波利尼西亚", "帕皮提"], ["诺福克岛", "金斯敦"], ["库克群岛", "阿瓦鲁阿"], ["瑙鲁", "瑙鲁"]];
	var answer = null;
	if(question.indexOf("首都") !=-1 ) {
		for(var i=0; i<contCapi.length; i++) {
			if(question.indexOf(contCapi[i][0]) != -1) {
				answer = contCapi[i][1];
				break;
			}
			if(question.indexOf(contCapi[i][1]) != -1) {
				answer = contCapi[i][0];
				break;
			}
		}
	}
	return answer;
}